# 2 расставить скобки так, чтобы значение выражений не поменялось
# проверка
x = 17/2*3+2
y = (((17/2)*3)+2)
if x == y:
    print(f'{x} = {y}')
else:
    print(f'{x} != {y}')
x = 2+17/2*3
y = (2+((17/2)*3))
if x == y:
    print(f'{x} = {y}')
else:
    print(f'{x} != {y}')
x = 19 % 4+15/2*3
y = ((19 % 4)+((15/2)*3))
if x == y:
    print(f'{x} = {y}')
else:
    print(f'{x} != {y}')
x = (15+6)-10*4
y = ((15+6)-(10*4))
if x == y:
    print(f'{x} = {y}')
else:
    print(f'{x} != {y}')
x = 17/2 % 2*3**3
y = (((17/2) % 2)*(3**3))
if x == y:
    print(f'{x} = {y}')
else:
    print(f'{x} != {y}')
