# 4 Сумма цифр трехзначного числа (используя input для ввода значений пользователем)
import math
x = input('Ввод трехзначного числа: ')
print(f'{x[0]}+{x[1]}+{x[2]}={int(x[0])+int(x[1])+int(x[2])}')

# =======================================================================

x = int(input('Ввод трехзначного числа: '))
num_1 = x % 10
num_2 = math.floor(x/10 % 10)
num_3 = math.floor(x/100 % 100)
print(f'{num_1}+{num_2}+{num_3}={num_1+num_2+num_3}')

# ========================================================================

# // и %
x = int(input('Ввод трехзначного числа: '))
num_1 = x % 10
num_2 = x % 100 // 10
num_3 = x % 1000 // 100
print(f'{num_1}+{num_2}+{num_3}={num_1+num_2+num_3}')
