# Дан список чисел. Вернуть список, где при помощи функции map() каждое число
# переведено в строку. В качестве функции в тар использовать lambda.


print(list(map(lambda x: str(x),[1, 2, 5, 7, 0])))
