"""
Написать лямбда функцию определяющую чётное/нечётное. Функция принимает определяю
определяющую чётное/нечётное. Функция принимает щую определяющую чётное/нечётное.
Функция принимает чётное нечётное Функция принимает
параметр число и если чётное то выдаёт слово “чётное”, если нет - то “нечётное”.
если нет то “нечётное”
"""
is_even = lambda x: "чётное" if x % 2 == 0 else "нечётное"
print(is_even(4))
