'''
Дан список целых чисел.
Создать новый список, каждый элемент которого равен исходному элементу
умноженному на -2
'''

print([i* -2 for i in [2,8,5,7,0,-9,-1]])
