 # Дан список целых чисел. Подсчитать сколько четных чисел в списке

print(sum([1 for i in [2,8,5,7,0,-9,-1] if not i%2]))
