# Дан список целых чисел.
# Создать новый список, каждый элемент которого равен исходному элементу
# умноженному на -2.

print([i * -2 for i in [1, 2, 5, 9, 12, 0, 25, 8]])
