'''Дан список целых чисел.Создать новый список,
каждый элемент которого равен исходному элементу умноженному на -2.'''

result = [-2 * i for i in [1, 3, 5, 6, 2]]
print(result)
