# import numpy as np

# Создайте два массива случайных чисел одинакового размера.
# Выполните поэлементное сложение, вычитание, умножение и деление этих массивов.

# a = np.random.random((3, 3))
# b = np.random.random((3, 3))

# print(a + b)
# print(20*'-')
# print(a - b)
# print(20*'-')
# print(a * b)
# print(20*'-')
# print(a / b)

# Сгенерируйте случайный массив чисел и найдите его среднее значение, медиану и сумму элементов.

# a = np.array([1, 2, 3, 8, 100, 0])
#
# print(np.mean(a))
# print(np.median(a))
# print(np.sum(a))

# Создайте два случайных массива, представляющих вектора, и выполните следующие операции:
#     - Найдите скалярное произведение векторов.
#     - Найдите векторное произведение векторов.

# a = np.array([1, 2, 3])
# b = np.array([4, 5, 6])
#
# print(np.dot(a, b))
# print(np.cross(a, b))
