LIMIT_ITEM_PAGE = 5  # количество элементов в меню
MENU = {
    "main": """
----------------- МЕНЮ -----------------------------
            1. Заказы
            2. Пользователи
            3. Книги
            4. Жанры
            0. Выйти
----------------------------------------------------
    """,
    "sub_menu_1": """
----------------- ЗАКАЗЫ ---------------------------
            1. Изменить
            2. Добавить
            3. Удалить
< Назад                     Далее >
            0. Назад
----------------------------------------------------
    """,
    "sub_menu_2": """
----------------- ПОЛЬЗОВАТЕЛИ ---------------------
            1. Изменить
            2. Добавить
            3. Удалить
< Назад                     Далее >
            0. Назад
----------------------------------------------------
    """,
    "sub_menu_3": """
----------------- КНИГИ ----------------------------
            1. Изменить
            2. Добавить
            3. Удалить
< Назад                     Далее >
            0. Назад
----------------------------------------------------
    """,
    "sub_menu_4": """
----------------- ЖАНР -----------------------------
            1. Изменить
            2. Добавить
            3. Удалить
< Назад                     Далее >
            0. Назад 
----------------------------------------------------
    """
}
