#Создать новый список, сдвинутый на 1 элемент влево
list_1 = [1,2,3,4,5]

list_1 = list_1[1:] + list_1[:1]
print(list_1)




#
